#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/resourceGroups/rg-tag-uat-its]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/resourceGroups/rg-tag-uat-its/providers/microsoft.insights/components/api-tag-uat-its]
azurerm_app_service_plan.main: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/resourceGroups/rg-tag-uat-its/providers/Microsoft.Web/serverfarms/asp-tag-uat-its]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/resourceGroups/rg-tag-uat-its/providers/Microsoft.Storage/storageAccounts/sttaguatits]
azurerm_function_app.main: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/resourceGroups/rg-tag-uat-its/providers/Microsoft.Web/sites/ft-tag-uat-its]
azurerm_role_assignment.tag-contributor: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/providers/Microsoft.Authorization/roleAssignments/9070d7ac-75a6-c89c-4b42-5a30384d69c5]
azurerm_role_assignment.reader: Refreshing state... [id=/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e/providers/Microsoft.Authorization/roleAssignments/94608bc7-0664-692e-4165-54cc2a25ca22]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service_plan.main will be created
  + resource "azurerm_app_service_plan" "main" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "asp-tag-uat-its"
      + reserved                     = false
      + resource_group_name          = "rg-tag-uat-its"
      + tags                         = {
          + "application" = "tag"
          + "environment" = "uat"
          + "owner"       = "its"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "uksouth"
      + name                                  = "api-tag-uat-its"
      + resource_group_name                   = "rg-tag-uat-its"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application" = "tag"
          + "environment" = "uat"
          + "owner"       = "its"
        }
    }

  # azurerm_function_app.main will be created
  + resource "azurerm_function_app" "main" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + client_affinity_enabled        = (known after apply)
      + custom_domain_verification_id  = (known after apply)
      + default_hostname               = (known after apply)
      + enable_builtin_logging         = true
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + kind                           = (known after apply)
      + location                       = "uksouth"
      + name                           = "ft-tag-uat-its"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "rg-tag-uat-its"
      + site_credential                = (known after apply)
      + storage_account_access_key     = (sensitive value)
      + storage_account_name           = "sttaguatits"
      + storage_connection_string      = (sensitive value)
      + tags                           = {
          + "application" = "tag"
          + "environment" = "uat"
          + "owner"       = "its"
        }
      + version                        = "~1"

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                   = (known after apply)
          + auto_swap_slot_name         = (known after apply)
          + ftps_state                  = (known after apply)
          + health_check_path           = (known after apply)
          + http2_enabled               = (known after apply)
          + ip_restriction              = (known after apply)
          + linux_fx_version            = (known after apply)
          + min_tls_version             = (known after apply)
          + pre_warmed_instance_count   = (known after apply)
          + scm_ip_restriction          = (known after apply)
          + scm_type                    = (known after apply)
          + scm_use_main_ip_restriction = (known after apply)
          + use_32_bit_worker_process   = (known after apply)
          + websockets_enabled          = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-tag-uat-its"
      + tags     = {
          + "application" = "tag"
          + "environment" = "uat"
          + "owner"       = "its"
        }
    }

  # azurerm_role_assignment.reader will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "reader"
      + scope                            = "/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.tag-contributor will be created
  + resource "azurerm_role_assignment" "tag-contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "tag contributor"
      + scope                            = "/subscriptions/750d42a4-82ff-4bbd-8d2c-ec111fe9b39e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "uksouth"
      + min_tls_version                  = "TLS1_0"
      + name                             = "sttaguatits"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "rg-tag-uat-its"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "application" = "tag"
          + "environment" = "uat"
          + "owner"       = "its"
        }

      + blob_properties {
          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @sfasher-slalom, Action: `pull_request`*